#include <iostream>
/* Вам надо написать класс Date для хранения даты григорианского календаря. Используйте три переменных типа int для хранения дня, месяца и года. В вашем классе должен быть следующий публичный интерфейс:
Конструктор, принимающий на вход три числа: день, месяц и год. В случае некорректной даты должна создаваться дата 
1 января 1970 года.
Константные функции GetDay, GetMonth и GetYear.
Бинарные операторы + и -, где вторым аргументом является целое число — количество дней. Эти операторы должны вернуть новую дату, отстоящую от заданной на указанное число дней.
Бинарный оператор -, вычисляющий разность между двумя датами и возвращающий int – количество дней.
Считайте, что все обрабатываемые даты будут лежать в пределах от 
1 января 1970 года до 31 декабря 2099 года.*/

class Date {
  private: 
  int Day{1};
  int Month{1};
  int Year{1970};
  public:
  Date (int d, int m, int y){
    bool isCorrectDate = false;
    if(m < 1 || m > 12) {
      isCorrectDate = true;
    }
    // if (m
    if (isCorrectDate == true) {
      Day = d;
      Month = m;
      Year = y;
    } else {
       Day = 1;
      Month = 1;
      Year = 1970;
  }
//   int GetDay()  const;
//   int GetMonth() const;
//   int GetYear() const;
}

int main()
{
  return 0;
}
