#include <iostream>
/*
Дан список всех файлов в некоторой файловой системе. Необходимо вывести все непустые директории этой файловой 
системы в лексикографическом порядке.
Гарантируется, что все пути начинаются от корня файловой системы. Все пути состоят из слешей (/), 
латинских символов, цифр и точек. Два слеша никогда не стоят подряд.
Формат ввода
На вход подаются строки, описывающие пути ко всем файлам в системе. 
Каждый путь содержится в отдельной строке. Число строк не превосходит 10000.
Формат вывода
Выведите все непустые директории в этой файловой системе в лексикографическом порядке. 
Каждый путь должен начинаться со слеша и заканчиваться слешом.
Пример 1
Ввод
/docs/README.txt
/docs/LICENSE.txt
/boot/grub
/init
Вывод
/
/boot/
/docs/
*/
int main()
{
  return 0;
}
