#include <vector>
#include <iostream>
/*
Выведите k самых частотных слов текста и их частоты.
Формат ввода. В первой строке указано натуральное число k, не превосходящее 1000. 
Далее идут строки текста объёмом до 1 Mб. Слова в тексте разделены пробелами или переводами строк. 
Различать регистр и обрабатывать пунктуацию не нужно.
Формат вывода. В выводе должно быть не более k самых частотных слов текста.
Через табуляцию после слова напечатайте его частоту. Слова должны быть упрядочены по убыванию частоты,
а при равенстве частот — по алфавиту.
Пример
Ввод
3
to be or not to be
that is the question
Вывод
be	2
to	2
is	1
*/
int main()
{
  return 0;
}
