#include <iostream>
/*
Будем называть символьной n-граммой последовательность из 
n последовательно идущих символов в одном слове в тексте. Для данного числа 
n подсчитайте суммарное количество каждой n-граммы в тексте.
Формат ввода
В первой строке заданы два числа: m — число слов в тексте (от 1 до 100000) и n — длина 
n-граммы (от 1 до 5). Далее идет 
m слов. Можно считать, что слова отделены пробелами или переносами строк. Обработку пунктуации и регистра реализовывать не нужно. Читайте слова просто через std::cin >> word.
Формат вывода
Выведите все n-граммы, отсортированные по убыванию частоты, а в случае равных 
частот — лексикографически (по алфавиту). Для каждой n-граммы напечатайте также
её частоту (смотрите формат в примере).
Пример
Ввод
6 2
to be or not to be
Вывод
be - 2
to - 2
no - 1
or - 1
ot - 1
*/
int main()
{
  
  return 0;
}
