#include <iostream>
#include <vector>
/*
На мероприятие приглашены   n  n гостей. Им предлагают занять места с номерами от 1 до   n  n в зале. Гости занимают эти места в произвольном порядке. Известно, на каком месте сел очередной гость.   Выпишите для каждого очередного места номер гостя, который на него сел.   
Формат ввода  Дано число   n  n, а затем   n  n различных чисел   a  1  ,  a  2  ,  .  .  .  ,  a  n  a   1  ​   ,a   2  ​   ,...,a   n  ​    от 1 до   n  n. Число   a  k  a   k  ​    — это номер места, на которое сел   k  k-й гость.   Число   n  n не превосходит 20000.   
Формат вывода  Выведите   n  n чисел   b  1  ,  b  2  ,  .  .  .  ,  b  n  b   1  ​   ,b   2  ​   ,...,b   n  ​    от 1 до   n  n. Число   b  k  b   k  ​    должно обозначать номер гостя, который сел на   k  k-е место.   
Пример 1  
Ввод   
5  
1 2 3 5 4  
Вывод   
1 2 3 5 4   
Пример 2  
Ввод   
11  
11 6 8 2 10 9 4 7 3 1 5  
Вывод   
10 4 9 7 11 2 8 3 6 5 1   
*/
int main()
{
  std::size_t n;
  std::vector<int> guests;
  for (std::size_t i = 0; i != n; ++i ){
    
  }
  return 0;
}