/*
Напишите класс Rational (рациональное число). Конструктор класса должен получать на вход два числа типа 
int (числитель и знаменатель). Считайте, что по умолчанию числитель равен 0, а знаменатель — 1.
Переопределите бинарные операторы сложения, вычитания, умножения и деления 
(работающие в том числе и с аргументами типа int), унарные плюс и минус. 
Предусмотрите функции-члены Numerator и Denominator для получения числителя и знаменателя несократимого 
представления этой дроби (знаменатель должен быть положительным). 
Переопределите также операторы +=, -=, *= и /=. Не забудьте определить операторы == и !=.
Примечание
Используйте функцию std::gcd стандартной библиотеки.
*/
class Rational {
  private:
  int numerator {0};
  int denominator {1};
  public:


};s
int main()
{
  return 0;
}
